[
  {
    "page": "1",
    "scraped_at": "2025-08-16T15:35:14.531941",
    "source": "zoopla",
    "property_id": "71073577",
    "property_url": "https://www.zoopla.co.uk/for-sale/details/71073577/",
    "listing_id": "71073577",
    "price": "220000",
    "property_type": "terraced",
    "tenure": "freehold",
    "bedrooms": "3",
    "bathrooms": "1",
    "receptions": "2",
    "has_epc": "False",
    "has_floorplan": "True",
    "size_sq_feet": "1044",
    "display_address": "New Barton Street, Salford M6",
    "outcode": "M6",
    "agent": "Hills",
    "chain_free": "False",
    "title": "3 bed terraced house for sale New Barton Street, Salford M6",
    "status": "Just added",
    "number_of_photos": "13",
    "number_of_floorplans": "1",
    "epc_rating": "D",
    "address": "New Barton Street, Salford M6",
    "price_per_sqft": "211",
    "council_tax_band": "A",
    "ground_rent": "£0",
    "room_lounge_m": "4.45m x 3.73m",
    "room_dining_room_m": "4.17m x 3.96m",
    "room_kitchen_m": "2.92m x 2.24m",
    "room_bedroom_one_m": "4.17m x 3.20m",
    "room_bedroom_two_m": "4.34m x 2.95m",
    "room_bedroom_three_m": "2.64m x 1.85m",
    "room_bathroom_m": "2.97m x 2.31m",
    "about_property": "Spacious Three Bedroom Period Property\nLocated in the Popular Irlam o' th' Heights\nBay-Fronted Lounge and a Spacious Dining Room\nFitted Kitchen and a Three-Piece Bathroom\nThree Well-Proportioned Bedrooms\nLow-Maintenance Courtyard Gardens to the Front and Rear\nWithin Easy Access of Local Schooling and Several Well-Kept Parks\nClose to Excellent Transport Links into Salford Quays, Media City and Manchester City Centre\nViewing is Highly Recommended!\nTake A look at this spacious three bedroom period terraced property! Located in the popular Irlam o’ th’ Heights - Could this be Your Next Move?\nLocated in the popular Irlam o’th’ Height area, the property is within easy access of amenities, local schooling and several well-kept parks, including Buile Hill Park, Oakwood Park and Light Oaks Park. It is also close to excellent transport links throughout Manchester, including into Salford Quays, Media City and Manchester City Centre.\nAs you enter the property you go into a welcoming entrance hallway, which flows through to the spacious dining room and the bay-fronted lounge. Towards the rear of the property you will find the fitted kitchen.\nUpstairs, there are three well-proportioned bedrooms and a three-piece family bathroom.\nExternally, to the front and rear there are low-maintenance courtyard gardens.\nProperties of this style are incredibly popular, get in touch to secure your viewing today!\nEPC Rating: D\nLounge\n (4.45m x 3.73m)\nDining Room\n (4.17m x 3.96m)\nKitchen\n (2.92m x 2.24m)\nBedroom One\n (4.17m x 3.20m)\nBedroom Two\n (4.34m x 2.95m)\nBedroom Three\n (2.64m x 1.85m)\nBathroom\n (2.97m x 2.31m)\nRead\n full description\nIn partnership with\nZoopla insights\nSign in and gain expert analysis to make informed decisions.\nStamp duty calculator\nOur instant calculator helps you understand how much stamp duty is due on property purchases in England &amp; Northern Ireland.\n\nRead the latest stamp duty news\nPrice\nYour situation\nPlease select\nBuying for the first time\nHome mover with one property\nBuying an additional property\nFrom 1st April 2025\n\n£-\nThis calculation is intended as a guide only. We are unable to provide financial advice, so it&#x27;s important to consult with an adviser. It applies to UK residents purchasing residential properties in England and Northern Ireland, but does not apply if the purchase is made through a company.",
    "nearest_stations": "Eccles (Manchester), Swinton (Manchester), Clifton (Manchester), Salford Crescent, Moorside, Patricroft, Salford Central, Manchester United Football Ground, Manchester Victoria, Deansgate",
    "nearest_stations_distances": "1.4, 1.5, 1.5, 1.8, 2, 2.2, 2.6, 2.8, 3, 3.1"
  },
  {
    "page": "1",
    "scraped_at": "2025-08-16T15:35:22.971416",
    "source": "zoopla",
    "property_id": "71072414",
    "property_url": "https://www.zoopla.co.uk/for-sale/details/71072414/",
    "listing_id": "71072414",
    "price": "430000",
    "property_type": "detached",
    "tenure": "freehold",
    "bedrooms": "3",
    "bathrooms": "3",
    "receptions": "1",
    "has_epc": "True",
    "has_floorplan": "True",
    "display_address": "Shergar Way, Salford M6",
    "outcode": "M6",
    "agent": "Hills",
    "chain_free": "True",
    "title": "3 bed detached house for sale Shergar Way, Salford M6",
    "status": "Just added",
    "number_of_photos": "22",
    "number_of_floorplans": "1",
    "epc_rating": "B",
    "address": "Shergar Way, Salford M6",
    "council_tax_band": "D",
    "ground_rent": "£0",
    "room_kitchen_m": "8.6m x 5.0m",
    "room_bedroom_two_m": "3.13m x 2.46m",
    "room_en_suite_m": "2.19m x 2.05m",
    "room_bedroom_three_m": "3.33m x 2.25m",
    "room_bathroom_m": "2.5m x 2.0m",
    "room_bedroom_one_m": "5.73m x 3.99m",
    "about_property": "Prestigious, Modern Four Bedroom Detached Property Coming To The Market chain free!\nLocated on the Popular Castle Irwell Development\nSpacious family lounge\nBright and Airy Kitchen Diner with Modern Units and Patio Doors to the Rear\nFour Generously-Sized Bedrooms\nSecond Bedroom Benefits from an Ensuite and a Juliette Balcony\nLarge Main Bedroom with an Ensuite and Access to a Balcony\nStylish Three-Piece Family Bathroom and a Downstairs W/C\nGenerously-Sized Garden to the Rear\nDriveway for Off-Road Parking\n*Located on the Popular Castle Irwell Development is this Prestigious Four Bedroom Detached Property! Featuring a Generous Plot, Ensuites to Two of the Bedrooms and a Private Balcony to the Main Bedroom!*\nWhat a fantastic property, and what a stunning development!\nThe Castle Irwell development has been thoughtfully designed, incorporating tranquil communal spaces and a children’s play area.\nThis beautiful home would be perfect for someone who is looking to upsize to a property that is ready for them to pack their bags and move in! Situated in a convenient location, the property is within easy access of Salford Quays, Media City and Manchester City Centre.\nAs you enter the property you head into a welcoming entrance hallway, which provides access to the downstairs W/C, the family lounge - featuring a patio door - and the modern kitchen diner, which benefits from plenty of natural light from the windows and patio doors to the rear.\nOn the first floor, there are three generously-sized bedrooms, with an ensuite and a juliette balcony to the second bedroom. There is also a generously-sized, stylish three-piece family bathroom.\nOn the top floor, you will find the large main bedroom, complete with an ensuite shower room and access to the balcony.\nExternally, there is a generously-sized garden to the rear, complete with laid-to-lawn grass and paving. There is also a driveway to the side for off-road parking.\nViewing is highly recommended to appreciate what this lovely home has to offer - get in touch to secure your viewing today!\nEPC Rating: B\nLounge / Kitchen\n (8.6m x 5.0m)\nBedroom Two\n (3.13m x 2.46m)\nEn Suite\n (1.97m x 1.87m)\nBedroom Three\n (3.33m x 2.25m)\nBathroom\n (2.5m x 2.0m)\nBedroom One\n (5.73m x 3.99m)\nEn Suite\n (2.19m x 2.05m)\nRead\n full description\nIn partnership with\nZoopla insights\nSign in and gain expert analysis to make informed decisions.\nStamp duty calculator\nOur instant calculator helps you understand how much stamp duty is due on property purchases in England &amp; Northern Ireland.\n\nRead the latest stamp duty news\nPrice\nYour situation\nPlease select\nBuying for the first time\nHome mover with one property\nBuying an additional property\nFrom 1st April 2025\n\n£-\nThis calculation is intended as a guide only. We are unable to provide financial advice, so it&#x27;s important to consult with an adviser. It applies to UK residents purchasing residential properties in England and Northern Ireland, but does not apply if the purchase is made through a company.",
    "nearest_stations": "Salford Crescent, Salford Central, Manchester Victoria, Deansgate, Manchester Oxford Road, Clifton (Manchester), Manchester Piccadilly, Eccles (Manchester), Manchester United Football Ground, Swinton (Manchester)",
    "nearest_stations_distances": "0.8, 1.4, 1.6, 2, 2.2, 2.3, 2.4, 2.6, 2.6, 2.8"
  }
]